In [1]:
import pandas as pd

# Sample data
data = {
    'Date': ['2025-08-01', '2025-08-01', '2025-08-02', '2025-08-02', '2025-08-02'],
    'Region': ['North', 'South', 'North', 'West', 'South'],
    'Product': ['TV', 'Laptop', 'Phone', 'TV', 'Phone'],
    'Price': [30000, 55000, 15000, 30000, 15000],
    'Quantity': [2, 1, 4, 1, 2]
}

df = pd.DataFrame(data)

# Save as CSV
df.to_csv('sales.csv', index=False)

df.head()

         Date Region Product  Price  Quantity
0  2025-08-01  North      TV  30000         2
1  2025-08-01  South  Laptop  55000         1
2  2025-08-02  North   Phone  15000         4
3  2025-08-02   West      TV  30000         1
4  2025-08-02  South   Phone  15000         2

In [3]:
# Read data
df = pd.read_csv('sales.csv')

# Add Revenue column
df['Revenue'] = df['Price'] * df['Quantity']

# Group by Region
region_sales = df.groupby('Region')['Revenue'].sum().reset_index()

# Group by Product
product_sales = df.groupby('Product')['Revenue'].sum().reset_index()

# Show results
print("Sales by Region:")
display(region_sales)

print("Sales by Product:")
display(product_sales)

Sales by Region:

  Region  Revenue
0  North   120000
1  South    85000
2   West    30000

Sales by Product:

  Product  Revenue
0  Laptop    55000
1   Phone    90000
2      TV    90000